# RemoveGeoref

## Description
Remove the georeferencing settings for a given layer handle, or for the document if NIL is provided.

```pascal
PROCEDURE RemoveGeoref(hLayer : HANDLE);
```

```python

def vs.RemoveGeoref(hLayer):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hLayer|HANDLE||

## Version
Availability: from Vectorworks 2023
## Category
* GIS